# DefaultOpenFromCloudCallback Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefaultOpenFromCloudCallback Class
Members See Also
---
A default callback that may be used to control Revit's behavior when opening a model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
	IDisposable
```

Visual Basic
---
```text
Public Class DefaultOpenFromCloudCallback _
	Implements IOpenFromCloudCallback, IDisposable
```

Visual C++
---
```text
public ref class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..DefaultOpenFromCloudCallback
# See Also
DefaultOpenFromCloudCallback Members
Autodesk.Revit.DB Namespace